app/controllers/posts_controller.rb

  def create
    helpers.signed_in_only
    @post = Post.new(post_params)
    @post.author = current_user.email
    @post.user_id=current_user.id


    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "updated_at", "title", "body", "author", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2021-06-17 22:44:23.657932"], ["updated_at", "2021-06-17 22:44:23.657932"], ["title", "final postf"], ["body", "finalff"], ["author", "mar123@hotmail.com"], ["user_id", 4]]

  def update
    @post = Post.find(params[:id])
    @post.user_id=current_user.id

    if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "posts" SET "updated_at" = ?, "body" = ?, "user_id" = ? WHERE "posts"."id" = ?  [["updated_at", "2021-06-17 22:44:37.110908"], ["body", "new postcdcd"], ["user_id", 4], ["id", 14]]